Revit 2027 API
TilePatternsBuiltIn Enumeration
Revit's built-in tile patterns. See TilePattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TilePatternsBuiltIn
Public Enumeration TilePatternsBuiltIn
public enum class TilePatternsBuiltIn
type TilePatternsBuiltIn
Members
Member name | Value | Description
Arrows | 11
HalfStep | 5
Hexagon | 4
Octagon | 13
OctagonRotate | 14
Rectangle | 1
RectangleCheckerboard | 8
Rhomboid | 3
RhomboidCheckerboard | 9
ThirdStep | 6
Triangle_Bent | 2
Triangle_Flat | 15
TriangleCheckerboard_Bent | 7
TriangleCheckerboard_Flat | 16
TriangleStep_Bent | 10
ZigZag | 12
See Also
Reference
Autodesk.Revit.DB Namespace